Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: It represents a reusable portion of your app's UI.
it_it: Rappresenta una porzione riutilizzabile dell'interfaccia utente della propria app.

source: It requires
it_it: Richiede

source: It returns a :cpp:type:`lv_subject_increment_dsc_t` pointer to configure the event further:
it_it: Restituisce un puntatore :cpp:type:`lv_subject_increment_dsc_t` per configurare ulteriormente l'evento:

source: It returns a pointer to the ``lv_monkey_t`` created.
it_it: Restituisce un puntatore al ``lv_monkey_t`` creato.

source: It returns an :cpp:type:`lv_timer_t` ``*`` which can be used later to modify the parameters of the Timer, pause it, or delete it when it is no longer needed.
it_it: Restituisce un :cpp:type:`lv_timer_t` ``*`` che può essere utilizzato in seguito per modificare i parametri del Timer, metterlo in pausa o eliminarlo quando non è più necessario.

source: It returns an ``lv_obj_t *`` that can be loaded as any regular :ref:`Screen <screens>` using :cpp:expr:`lv_screen_load()`.
it_it: Restituisce un ``lv_obj_t *`` caricabile come qualsiasi :ref:`Screen <screens>` normale utilizzando :cpp:expr:`lv_screen_load()`.

source: It returns an `lv_obj_t *` pointer.
it_it: Restituisce un puntatore `lv_obj_t *`.

source: It serves as an alternative to the X11 and SDL2 drivers.
it_it: Funziona come alternativa ai driver X11 e SDL2.

source: It should be called after GPIO and SPI is initialized.
it_it: Dovrebbe essere chiamato dopo l'inizializzazione di GPIO e SPI.

source: It should be noted that before destruction, it is necessary to ensure that the application has deleted all fonts using :cpp:func:`lv_font_manager_delete_font`.
it_it: Prima di procedere all'eliminazione, è necessario assicurarsi che l'applicazione abbia eliminato tutti i font utilizzando :cpp:func:`lv_font_manager_delete_font`.

source: It should be noted that each image decoded needs to consume:
it_it: Si noti che ogni immagine decodificata deve consumare:

source: It should be noted that each image of this decoder needs to consume
it_it: Si noti che ogni immagine di questo decoder deve occupare

source: It should be noted that the ``src`` parameter must strictly correspond to ``class_p``.
it_it: È importante notare che il parametro ``src`` deve corrispondere rigorosamente a ``class_p``.

source: It shows the file count of every compress level.
it_it: Mostrano il numero di file per ogni livello di compressione.

source: It simplifies power savings, screen rotation and other platform specific nuances.
it_it: Semplifica il risparmio energetico, la rotazione dello schermo e altre funzionalità specifiche della piattaforma.

source: It specifically details the all the steps needed to get the LVGL example project `alif_m55-lvgl <https://github.com/alifsemi/alif_m55-lvgl>`__ running on the `Alif E7 Devkit Gen2 <https://alifsemi.com/ensemble-e7-series/>`__; however, any project based on the `Alif VS Code Template <https://github.com/alifsemi/alif_vscode-template>`__ has a nearly identical setup process so this can be used as a general guide for those.
it_it: Descrive in dettaglio tutti i passaggi necessari per far funzionare il progetto di esempio LVGL `alif_m55-lvgl <https://github.com/alifsemi/alif_m55-lvgl>`__ su `Alif E7 Devkit Gen2 <https://alifsemi.com/ensemble-e7-series/>`__; tuttavia, qualsiasi progetto basato sul `Alif VS Code Template <https://github.com/alifsemi/alif_vscode-template>`__ ha una procedura di installazione pressoché identica, quindi questa può essere utilizzata come guida generale per questi progetti.

source: It support only integer Subjects.
it_it: Supporta solo Subject interi.

source: It supports a wide variety of devices, sensors and integrations to Home Automation and Cloud services.
it_it: Supporta un'ampia varietà di dispositivi, sensori e integrazioni con servizi di domotica e cloud.

source: It supports all Cortex-M processors ranging from Cortex-M0 to the latest Cortex-M85.
it_it: Supporta tutti i processori Cortex-M, dal Cortex-M0 al più recente Cortex-M85.

source: It supports all the built-in LVGL drivers in a preconfigured :ref:`build_cmake` build system, making it easy to integrate into any platform or environment.
it_it: Supporta tutti i driver LVGL integrati in un sistema di build :ref:`build_cmake` preconfigurato, facilitando l'integrazione in qualsiasi piattaforma o ambiente.

source: It supports both performance monitoring (CPU usage and FPS) and memory monitoring (used memory and fragmentation).
it_it: Supporta sia il monitoraggio delle prestazioni (utilizzo della CPU e FPS) sia il monitoraggio della memoria (memoria utilizzata e frammentazione).

source: It supports forward and reverse play of the entire Animation group, using :cpp:expr:`lv_anim_timeline_set_reverse(timeline, reverse)`.
it_it: Supporta la riproduzione in avanti e all'indietro dell'intero gruppo di Animazione, utilizzando :cpp:expr:`lv_anim_timeline_set_reverse(timeline, reverse)`.

source: It supports integer and float subjects.
it_it: Supporta Subject interi e float.

source: It supports integer subjects and, when ``LV_USE_FLOAT`` is enabled, float subjects.
it_it: Supporta soggetti interi e, quando ``LV_USE_FLOAT`` è abilitato, subject float.

source: It supports integer subjects.
it_it: Supporta i Subject interi.

source: It supports only integer subjects.
it_it: Supporta solo soggetti interi.

source: It supports only pointer subjects.
it_it: Supporta solo subject puntatore.

source: It supports the full glTF 2.0 specification with advanced rendering features.
it_it: Supporta la specifica glTF 2.0 completa con funzionalità di rendering avanzate.

source: It supports various formats and compression.
it_it: Supporta vari formati e compressioni.

source: It supports:
it_it: Supporta:

source: It uses CMake to generate the required protocols at build time.
it_it: Utilizza CMake per generare i protocolli richiesti in fase di compilazione.

source: It uses LVGL's built-in Windows drivers to open a window where you can see the LVGL-rendered UI, and use your mouse as a touch input replacement.
it_it: Utilizza i driver Windows integrati di LVGL per aprire una finestra in cui è possibile visualizzare l'interfaccia utente renderizzata da LVGL e utilizzare il mouse come sostituto dell'input touch.

source: It uses React's virtual DOM concept to manipulate LVGL UI components, providing a familiar React-like experience to users.
it_it: Sfrutta il concetto di DOM virtuale di React per manipolare i componenti dell'interfaccia utente LVGL, offrendo agli utenti un'esperienza familiare simile a React.

source: It uses Wayland's shared memory protocol (``wl_shm``) for rendering, which is supported across all Wayland compositors.
it_it: Utilizza il protocollo di memoria condivisa di Wayland (``wl_shm``) per il rendering, supportato da tutti i compositori Wayland.

source: It uses `SDL <https://www.libsdl.org/>`__ to open a window, show the rendered content, and manage mouse and keyboard.
it_it: Utilizza `SDL <https://www.libsdl.org/>`__ per aprire una finestra, visualizzare il contenuto renderizzato e gestire mouse e tastiera.

source: It uses a specialized, :ref:`build_cmake`‑based build system—check the README for full setup details.
it_it: Utilizza un sistema di build specializzato, basato su :ref:`build_cmake`: consultare il file README per i dettagli completi sulla configurazione.

source: It uses the :ref:`typical background style properties <typical bg props>`.
it_it: Utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: It uses the `code128 <https://github.com/fhunleth/code128>`__ library by `fhunleth <https://github.com/fhunleth>`__.
it_it: Utilizza la libreria `code128 <https://github.com/fhunleth/code128>`__ library by `fhunleth <https://github.com/fhunleth>`__.

source: It uses the common API, no extra configuration is required:
it_it: Utilizza l'API comune, non è richiesta alcuna configurazione aggiuntiva:

source: It will "copy" the ``lvgl`` repository to your GitHub account (``https://github.com/<YOUR_NAME>?tab=repositories``)
it_it: Il repository ``lvgl`` verrà "copiato" sul proprio account GitHub (``https://github.com/<YOUR_NAME>?tab=repositories``)

source: It will allow running multiple LVGL instances by storing LVGL's global variables in TLS (Thread-Local Storage).
it_it: Questo consentirà l'esecuzione di più istanze di LVGL memorizzando le variabili globali di LVGL in TLS (Thread-Local Storage).

source: It will automatically run any demo that is enabled in ``lv_conf.h``.
it_it: Verrà eseguita automaticamente qualsiasi demo abilitata in ``lv_conf.h``.

source: It will be called again after its currently-set period (in milliseconds) has elapsed.
it_it: Verrà richiamato nuovamente dopo che il periodo attualmente impostato (in millisecondi) sarà trascorso.

source: It will be referred to as DMA2D on this page.
it_it: Qui verrà chiamato DMA2D.

source: It will be treated as a template which will be used to create the scroll animations.
it_it: Verrà trattato come un template utilizzato per creare le animazioni dello scorrimento.

source: It will be used later.
it_it: Verrà utilizzato in seguito.

source: It will clean the screen and create a fresh instance of the ``view`` to be tested.
it_it: Pulirà lo schermo e creerà una nuova istanza della ``view`` da testare.

source: It will create `my_indicator_t *` elements, the same way as, for example, :cpp:expr:`lv_chart_add_series` works.
it_it: Creerà elementi `my_indicator_t *`, allo stesso modo di :cpp:expr:`lv_chart_add_series`, per esempio.

source: It will install CMake, ninja-build, a GCC ARM compiler, and cmsis-toolbox.
it_it: Verranno installati CMake, ninja-build, un compilatore GCC ARM e cmsis-toolbox.

source: It will just take every byte of the binary file you uploaded and write it as an image "bitmap".
it_it: Prenderà ogni byte del file binario caricato e lo scriverà come un'immagine "bitmap".

source: It will not remap keys from other input device types.
it_it: Non rimapperà i tasti di altri tipi di dispositivi di input.

source: It will persist even after ``make distclean`` because the build system will not remove lvgl if it is a Git repo.
it_it: Persisterà anche dopo ``make distclean`` perché il sistema di build non rimuoverà lvgl se si tratta di un repository Git.

source: It will recursively walk through all that Widget's children (starting with the Widget itself) and print the Widget's parent's address, the Widget's address, and if :c:macro:`LV_USE_OBJ_ID` equates to a non-zero value, will also print the output of :cpp:func:`lv_obj_stringify_id` for that Widget.
it_it: Esaminerà ricorsivamente tutti i figli del Widget (a partire dal Widget stesso) e stamperà l'indirizzo del genitore del Widget, l'indirizzo del Widget e, se :c:macro:`LV_USE_OBJ_ID` è uguale a un valore diverso da zero, stamperà anche l'output di :cpp:func:`lv_obj_stringify_id` per quel Widget.

source: It will remove the existing unpacked LVGL and ZIP if there is one.
it_it: Questo rimuoverà il file LVGL e lo ZIP decompressi esistenti, se presenti.

source: It will return ``true`` if the Widget is currently in that state.
it_it: Restituirà ``true`` se il widget si trova attualmente in quello stato.

source: It will return the first connected card it can find.
it_it: Restituirà la prima scheda connessa che riesce a trovare.

source: It will use the :cpp:enumerator:`LV_STATE_CHECKED` styles.
it_it: Utilizzerà gli stili :cpp:enumerator:`LV_STATE_CHECKED`.

source: It works asynchronously with the CPU.
it_it: Funziona in modo asincrono con la CPU.

source: It works at runtime and it's a great way to check the appearace or event the layout based on a condition.
it_it: Funziona a runtime ed è un ottimo modo per controllare l'aspetto o l'evento del layout in base a una condizione.

source: It works on both integer and float subjects, but the min/max value is an integer in both cases.
it_it: Funziona sia con subject interi che float, ma il valore min/max è un intero in entrambi i casi.

source: It works similarly to the *TAB* key on a PC to select an element in an application or web page.
it_it: Funziona in modo simile al tasto *TAB* su un PC per selezionare un elemento in un'applicazione o in una pagina web.

source: It works with very low memory consumption, so that it can be incorporated into tiny microcontrollers, such as AVR, 8051, PIC, Z80, Cortex-M0, etc..
it_it: Funziona con un consumo di memoria molto basso, quindi può essere integrato in microcontrollori di piccole dimensioni, come AVR, 8051, PIC, Z80, Cortex-M0, ecc.

source: It wraps `BG_GRAD_COLOR`, `BG_GRAD_DIR`, `BG_MAIN_STOP` and `BG_GRAD_STOP` into one descriptor and allows creating gradients with more colors as well.
it_it: Include `BG_GRAD_COLOR`, `BG_GRAD_DIR`, `BG_MAIN_STOP` e `BG_GRAD_STOP` in un unico descrittore e consente di creare gradienti anche con più colori.

source: It's a common requirement to update a Subject based on a user action (trigger).
it_it: È un requisito comune aggiornare un Subject in base a un'azione dell'utente (trigger).

source: It's a fully functional LVGL + MicroPython that runs entirely in the browser and allows you to edit a python script and run it.
it_it: È un simulatore LVGL + MicroPython completamente funzionante che funziona interamente nel browser e permette di modificare uno script Python ed eseguirlo.

source: It's a general property which can be set for every Widget.
it_it: È una proprietà generale che può essere impostata per ogni Widget.

source: It's a great way to implement a light/dark theme switch by normally adding the styles for the light theme, and binding only a few styles for the dark theme to change only a few colors if, e.g., a ``dark_theme`` subject is ``1``.
it_it: È un ottimo modo per implementare un cambio di tema chiaro/scuro, aggiungendo normalmente gli stili per il tema chiaro e vincolando solo alcuni stili per il tema scuro, in modo da modificare solo pochi colori se, ad esempio, un soggetto ``dark_theme`` è ``1``.

source: It's a great way to map every slider's color or opacity to a subject and control it externally.
it_it: È un ottimo modo per mappare il colore o l'opacità di ogni slider a un oggetto e controllarlo esternamente.

source: It's a great way to:
it_it: È un ottimo modo per:

source: It's a logical container for other widgets.
it_it: È un contenitore logico per altri widget.

source: It's a rare case of an x86 CPU being used in a real-time setting.
it_it: È un caso raro di utilizzo di una CPU x86 in un ambiente real-time.

source: It's also assumed that permanent screens are created when the UI is initialized.
it_it: Si presume inoltre che le schermate permanenti vengano create all'inizializzazione dell'interfaccia utente.

source: It's also easy to port LVGL to any Windows IDEs or toolchains using either the built-in SDL driver or the Windows driver.
it_it: È anche facile portare LVGL su qualsiasi IDE o toolchain Windows utilizzando il driver SDL integrato o il driver Windows.

source: It's also possible to run each step separately, one after another.
it_it: È anche possibile eseguire ogni passo separatamente, uno dopo l'altro.

source: It's also possible to set the target ``color_format="..."`` of the images.
it_it: È anche possibile impostare il ``color_format="..."`` target delle immagini.

source: It's always rendered as a full rectangle.
it_it: Viene sempre renderizzato come un rettangolo pieno.

source: It's available for use with NXP's general purpose and crossover microcontrollers, providing developers with a tool for creating complete, high quality GUI applications with LVGL.
it_it: È disponibile per l'uso con i microcontrollori generici e crossover di NXP, fornendo agli sviluppatori uno strumento per creare applicazioni GUI complete e di alta qualità con LVGL.

source: It's built on top of :ref:`LVGL's translation module <translation>`.
it_it: È basato sul :ref:`modulo di traduzione di LVGL <translation>`.

source: It's covered in :ref:`change_subject_on_event`
it_it: È trattato in :ref:`change_subject_on_event`

source: It's created by a group of volunteers who made it available for you in their free time.
it_it: È stato creato da un gruppo di volontari che lo hanno reso disponibile a tutti nel loro tempo libero.

source: It's described as:
it_it: Viene descritta come:

source: It's good to note that RGB565A8 and ARGB8888 are converted to ARGB4444 before being uploaded to EVE.
it_it: È importante notare che RGB565A8 e ARGB8888 vengono convertiti in ARGB4444 prima di essere caricati su EVE.

source: It's intended use is to:
it_it: Lo scopo è:

source: It's lighter than MicroPython, requiring only 32k of code space and 4k of RAM, which means it can run on stm32f103c8 (blue-pill) or even stm32g030c8.
it_it: È più leggero di MicroPython, richiedendo solo 32k di spazio per il codice e 4k di RAM, il che significa che può essere eseguito su stm32f103c8 (blue-pill) o persino stm32g030c8.

source: It's like a border but drawn outside of the rectangles.
it_it: È come un bordo, ma disegnato all'esterno dei rettangoli.

source: It's like saving the blueprint of the components.
it_it: È come salvare il progetto dei componenti.

source: It's like the Widget was "thrown" and scrolling slows down smoothly.
it_it: È come se il widget fosse stato "lanciato" e lo scorrimento rallenta gradualmente.

source: It's not always possible to take an indev reading directly inside a raw interrupt handler.
it_it: Non è sempre possibile effettuare la lettura di un indev direttamente all'interno di un semplice "interrupt handler".

source: It's not mandatory to use the whole display for LVGL, however in some cases the physical resolution is important.
it_it: Non è obbligatorio utilizzare l'intero display per LVGL, tuttavia in alcuni casi la risoluzione fisica è importante.

source: It's not required to know the current layer to modify a draw task.
it_it: Non è necessario conoscere il layer corrente per modificare un task di disegno.

source: It's not required to set all the properties in one style.
it_it: Non è necessario impostare tutte le proprietà in un unico stile.

source: It's not scalable.
it_it: Non è scalabile.

source: It's possible to add more styles to a Widget and have the latter added style modify or extend appearance.
it_it: È possibile aggiungere più stili a un Widget e fare in modo che quest'ultimo modifichi o estenda l'aspetto.

source: It's possible to create new widgets by writing C code manually (the same way as built-in LVGL widgets are created), however, using the UI |nbsp| Editor is much faster and simpler.
it_it: È possibile creare nuovi widget scrivendo manualmente codice C (allo stesso modo in cui vengono creati i widget LVGL nativi), tuttavia, utilizzare l'editor dell'interfaccia utente è molto più veloce e semplice.

source: It's possible to set
it_it: È possibile impostare

source: It's possible to set a :ref:`Subject <observer_subject>` value on user interaction by adding a special child to any widget:
it_it: È possibile impostare un valore :ref:`Subject <observer_subject>` durante l'interazione dell'utente aggiungendo un elemento figlio speciale a qualsiasi widget:

source: It's possible to set e.g. rose color for :cpp:expr:`LV_STATE_PRESSED | LV_STATE_FOCUSED`.
it_it: È possibile impostare, ad esempio, il colore rosa per :cpp:expr:`LV_STATE_PRESSED | LV_STATE_FOCUSED`.

source: It's recommended to use :cpp:expr:`lv_snapshot_reshape_draw_buf(widget, draw_buf)` to first ensure the buffer is large enough, and if it fails, destroy the existing draw buffer and call `lv_snapshot_take` directly.
it_it: Si consiglia di utilizzare :cpp:expr:`lv_snapshot_reshape_draw_buf(widget, draw_buf)` per assicurarsi innanzitutto che il buffer sia sufficientemente grande e, in caso di errore, eliminare il buffer di disegno esistente e chiamare direttamente `lv_snapshot_take`.

source: It's similar to a ``class`` in CSS.
it_it: È simile a una ``class`` in CSS.

source: It's similar to when you use your mouse on a PC to select text.
it_it: È simile a quando si utilizza il mouse su un PC per selezionare il testo.

source: It's smarter, with a unique C module mechanism that allows you to generate bindings automatically by simply writing the API for the C module in Python, and you don't need to deal with the headache of writing any macros or global tables manually.
it_it: È più intelligente, con un meccanismo esclusivo per i moduli C che consente di generare automaticamente i binding semplicemente scrivendo l'API per il modulo C in Python, senza dover affrontare il problema di dover scrivere manualmente macro o tabelle globali.

source: It's up to the driver how to mark directories in the result but it can be a good practice to insert a ``'/'`` in front of each directory name.
it_it: Spetta al driver decidere come contrassegnare le directory nel risultato, ma può essere una buona pratica inserire ``'/'`` davanti al nome di ogni directory.

source: It's up to you.
it_it: Dipende da cosa si sceglie.

source: It's useful to display complex effects on the arcs.
it_it: È utile per visualizzare effetti complessi sugli archi.

source: It's usually one word and can be chosen freely.
it_it: Di solito è una sola parola e può essere scelta liberamente.

source: It's very common to load or create Screens on a button click or other events.
it_it: È molto comune caricare o creare Schermate al clic di un pulsante o in seguito ad altri eventi.

source: It's very important that draw buffer(s) should be large enough for the selected color format.
it_it: È molto importante che il buffer di disegno sia sufficientemente grande per il formato colore selezionato.

source: It's very much like the C API, but Object-Oriented for LVGL components.
it_it: È molto simile all'API C, ma orientata agli oggetti per i componenti LVGL.

source: It's visible only if the Active Screen's background opacity is < 255.
it_it: È visibile solo se l'opacità dello sfondo della schermata attiva è < 255.

source: Italics, Boldface and Underlining
it_it: Corsivo, Grassetto e Sottolineatura

source: Its coordinates can be set as usual.
it_it: Le sue coordinate possono essere impostate come di consueto.

source: Its core part is a powerful XML editor with a real-time pixel-perfect preview.
it_it: Il suo cuore è un potente editor XML con un'anteprima pixel-perfect in real-time.

source: Its installation path will be needed later.
it_it: Il path di installazione sarà necessario in seguito.

source: Its main area is called the "Browsing Area" and provides the list of files contained in the currently-viewed directory.
it_it: La sua area principale è chiamata "Browsing Area" [Area di Navigazione] e fornisce l'elenco dei file contenuti nella directory attualmente visualizzata.

source: Its meaning depends on the type of Widget.
it_it: Il suo significato dipende dal tipo di Widget.

source: Its meaning is widget specific.
it_it: Il suo significato è specifico del widget.

source: Its only parameter is a path where the file-based assets (fonts and images) are located.
it_it: Il suo unico parametro è un path in cui si trovano le risorse basate su file (font e immagini).

source: Its orientation will be vertical if you set ``width`` < ``height``.
it_it: Il suo orientamento sarà verticale se si imposta ``width`` < ``height``.

source: Its padding values are interpreted relative to the background Arc.
it_it: I suoi valori di padding vengono interpretati in relazione all'Arco sullo sfondo.
